{
  "data": [
    {
      "id": "rec7hS0r7SWLoKJm0",
      "title": "Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior\n\n",
      "description": "Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior\n\n ",
      "content": "<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\" id=\"docs-internal-guid-8dbea941-7fff-3c39-83b2-54a85db1a595\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span style=\"-webkit-text-decoration-skip:none;font-style:normal;font-variant:normal;font-weight:400;text-decoration-skip-ink:none;vertical-align:baseline;white-space:pre-wrap;\"><u>Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior</u></span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">Fear not liberals, for reason and order are back in the White House. No more are the days of chaos and appointing mortal beings with no superpowers. This week, President Trump used his imagination to break boundaries from the Oval office, appointing Mesoamerican God of Rain, Quetzalcoatl (pronounced quet-sal-coa-tal), as Head of the Department of the Interior. Coatl had been on hiatus since 1519, when he was responsible for scaring the Aztecs into believing the Spaniards were white colored Gods (this part is not satire, that’s actually real). Trump touted Quetzalcoatl for such a successful propaganda campaign and white supremacist fundamentalism.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">Now before I continue, I know you readers have no idea what the Department of the Interior does. No yea, you claim to love political satire but don’t know how the government works. Sigh. Lemme dumb it down for you. No, it doesn’t build IKEA furniture or put up decorations. It basically just manages our land, resources, and maintains trusts with Native Americans tribes. Unfortunately, Pew Research Center has rated this department as the “most boring department.” A perfect place to finally spice things up.</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">As Head of the Department, Queztalcoatl promises that all of our sacrifices will not be in vain. His first plan was to take detained undocumented immigrants, and make the fight to the death against American citizens. The winner of the fight to the death would be deemed worthy of sacrifice to the Gods (again, this is real, I did my research). This would bring at least 7 months of rain, providing full harvests of maize. Wow! Sacrifices would have to take place somewhere important enough for the Gods. Quetzalcoatl proposed putting a guillotine on the Lincoln Memorial.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">The opposition response has been mixed. Former Speaker of the House and resident girlboss Nancy Pelosi stated that she is worried about sacrifices overall. “While I think it's good Trump hired an immigrant who is also indigenous, how will human sacrifice help my investment portfolio?” This appointment also comes with Quetzalcoatl’s initial statement: “Niuil noyuki ka anilitika okse teomeh nik in office” which translates to “Biden will be sacrificed first.”</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">His last announcement as a new appointee was to announce his deputies of the department, which every department is allowed to do. After being chosen so decisively, political experts predicted that the choice would calm politics, mainly a evangelical christian states man (white most likely), which would quell worries of a foreign, once believed dead, Meso-american god. However, in a shocking move, he appointed Lord Yama, the Hindu god of hell. Yama’s previous experience includes running the Gates of Hell Inc. for about 4,500 years. Despite his short experience as an executive, his record is fairly impressive in keeping hell working for so long.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;text-indent:36pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">What will this mean for the interior of America? Well, the expert opinion is still unsure. But what we can expect from the Trump Administration is more appointments that are out of this world. Trump seems to have moved on from the sexual abusers, sexist, alcoholics, Oil tycoons, wrestling ceos’ concubines, and other bootlickers. In exchange, Trump's search for power has now reached mythical proportions. Stay tuned as the Pinky Toe covers this very real story.</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span></span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span></span></p>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FPZM1R536%2Frec7h-S0r7-SWLo-KJm0-jpg.jpg",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-10T16:02:00.000Z",
      "name": [
        "Martin Akamine"
      ],
      "photo": [
        "recNwxpWgzmS6Ts1F"
      ],
      "name_photo": [
        "Elizabeth Morearty"
      ],
      "createdAt": "2025-04-19T21:59:55.030Z"
    },
    {
      "id": "reckZsvL5sxi3Iut7",
      "title": "Rating Each School by How Good Their Track Runners Are in Bed",
      "description": "I have a knack for sleeping with guys on sports teams. The only time I have ever caught balls was with my mouth. I hit a home run almost every weekend if you know what I mean. I have only ever hit cardio when riding is involved. I only run when I know a hunk is waiting for me at the finish line. Needless to say, I feel like I know Boston track stars pretty well. \n",
      "content": "Rating Each School by How Good Their Track Runners are in Bed \nRachel Stern \n\n\n“I’m a runner I’m a track star” - Mooski\n\nI have a knack for sleeping with guys on sports teams. The only time I have ever caught balls was with my mouth. I hit a home run almost every weekend if you know what I mean. I have only ever hit cardio when riding is involved. I only run when I know a hunk is waiting for me at the finish line. Needless to say, I feel like I know Boston track stars pretty well. \n\nHere are my rankings of teams that have crossed the finish line: \n\n5. Boston College: UGH. NO. Boston College is only good for 2 things, football and hockey. Now THOSE MEN know how to do it. But their track team?? Those fake Bostonians have me faking it. \n\n4. Tufts: The good-boys of the track-sex intersection. They just want to be told they are doing so great. An inordinate amount of them are still in love with their Christian high school ex-girlfriends, but this makes them incredible in bed. While not kinky, they will kiss your forehead and blush at praise. \n\n3. MIT: Boyfriend Dick. The perfect Goldilocks porridge. With the right amount of stamina and size, it always gets the job done. Are my legs shaking after? No, this is a marathon, not a sprint. But am I always satisfied? Yes, it is a beautifully average experience. \n\n2. BU: Kinky sex. Yum. \n\n1. Harvard: I hate to say it, but Harvard is my number 1. This is a race that leaves me breathless, legs shaking, sweat running, blown away. I didn’t know that daddy’s money could buy you good dick, but maybe I should have known that. Every time I go to a Harvard track event, I know I am getting it good. If only their legs could outrun their ego. \n\nThere you have it!! These are the men that have run right through my heart and straight to my pussy. I have never been so good at running, but maybe I should give the long jump a try since I seem to leap to conclusions. Have I mentioned that I accidentally fell in love with each of these men throughout my time in Boston? Anyway… more updates to come! Next up: I’m going to shoot my shot with basketball teams. ",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FQvP52q8H%2Freck-Zsv-L5sxi3-Iut7-jpg.jpg",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-09T16:03:00.000Z",
      "name": [
        "Rachel Stern"
      ],
      "photo": [
        "recZDtJSX5KOLTgH4"
      ],
      "name_photo": [
        "Lindsay Lee"
      ],
      "createdAt": "2025-04-19T21:59:55.030Z"
    },
    {
      "id": "recMzm4xyOTAIOUv8",
      "title": "I Blame RFK: My Accidental Mucinex High at 9 AM",
      "description": "After starting a new antidepressant this winter break, I hadn’t thought to look up the effects it would have on cough medicines. Nor did I ChatGPT it, which editor-in-chief of The Pinky Toe Ava Carrel suggested I do.",
      "content": "<body><p>So I’m sitting there. High in the GSU at ten in the morning. Congested as hell. Clutching my Urban Table yogurt cup like a lifeboat. Wondering if I just imagined last year’s talking stage walking into Back Court or if he actually looked like that the entire time.</p><p>One thing about me is I cannot stand being even slightly congested. I talk big game for a girl who is immediately overstimulated by post-nasal drip. And as the weather in Boston plummets to what feels like sub-zero temperatures (which could mean nothing), so does my general health and wellness. So, on a recent and fateful Sunday afternoon, I purchased enough off-brand Mucinex to supply a small village in the face of one of the greatest adversaries known to mankind – the common cold.</p><p>After taking one maximum dose Mucinex pill at one in the morning, which, my roommate has now informed me, contains some shit used in meth production, I fell quickly asleep. Blissfully, even, as I drifted into dreams of clear sinuses and a portable-tissue-free tote bag. Walter White made NOT A SINGLE APPEARANCE in my subconscious.</p><p>So, keeping that in mind, imagine my surprise when I woke up and, having unexpectedly lost my (usually fire) motor skills, tumbled off of my Boston University issued mattress and onto a floor that has not been vacuumed since move-in!</p><p><strong>Something was wrong.</strong></p><p><em>Colors?</em> Brighter than usual. <em>Shapes?</em> Haunting my periphery. <em>Head?</em> Ringing. <em>Walking?</em> On a diagonal. <em>Class?</em> In twenty minutes.</p><p>After a disorienting T ride and a giggle of pure childlike delight in response to the sound the elevator makes when it hits floor 2 of CGS, I made my way to my Understanding Television lecture <strong>high off a perc</strong>.</p><p>I couldn’t help but wonder what happened. I’ve taken Mucinex a million times. Why, all of a sudden, was I signing the wrong name on my attendance sheet?</p><p>After starting a new antidepressant this winter break, I hadn’t thought to look up the effects it would have on cough medicines. Nor did I ChatGPT it, which editor-in-chief of <em>The Pinky Toe</em> Ava Carrel suggested I do when I called her crouched with my forehead pressed against the side of a stall in the CGS bathroom. (Some people have asked me, hey, why didn’t you call your doctor first? Why, as you wondered if you were experiencing ER-warranting heart palpitations, call the editor-in-chief of <em>The Pinky Toe</em>? To that I say, I refer to the most trusted sources of information in my most trying times, a level of diligent media literacy we all should strive for in today’s political climate.) Ava assured me that I wasn’t going to die, just “don’t have caffeine or something stupid like that.”</p><p>Cancelling my Brown Sugar Oat Milk Shaken Espresso on Grubhub, I took a deep breath and decided that if Addison Rae could make an appearance at Sweat Tour, I could make an appearance at a lecture I pay to attend. I went back to class, tremors in my hand but in a cool, trend-setting, feminist kind of way. <em>The Greta Gerwig of hand tremors.</em></p><p>As I sat dazed in lecture, I wondered – <em>why</em>? Why me, why now? What sinister forces, karmic or unrelated, were at play on this random Monday morning?</p><p>Then, it hit me. Only one man could be behind this: <strong>Robert F. Kennedy, Jr. himself.</strong></p><p>As decreed by the alleged worm in RFK’s brain (which I’m convinced is more of a <em>Ratatouille</em> situation but can’t produce any real evidence for), we lowkey don’t fuck with antidepressants anymore.</p><p>And you know what? <strong>Yeah.</strong> Because no one told me shit about the Mucinex situation, and there I was, emailing my Screenwriting 1 professor about the irony of using a software called “Final Draft” to write my screenplay’s rough draft (<em>not even clever. Not even clever.</em>)</p><p>Then I thought about it more critically. Of course this happens now. Of course – <em>that’s what they want you to think.</em> They want you to think, <em>“no one told me shit about the Mucinex situation, no one told me shit about the Mucinex situation, go RFK, boo antidepressants.”</em></p><p>To this I say, <strong>no.</strong></p><p><strong>No.</strong> If this is the America we’re faced with in the year of our Lord 2025, an America where we’re expected to surrender our NDRIs over one measly Mucinex-induced fit of hysteria, then we have to face it head-on. RFK and his soon-to-be-revealed worm farm are trying to scare you into backing away from your hard-earned, well-deserved meds. You did not go through Spotify Wrapped after Spotify Wrapped with <em>“Funeral”</em> by Phoebe Bridgers in your top 5 just to stop taking your antidepressants over a cough!</p><p><strong>Resist.</strong> Stand up for your rights, one Mucinex high at a time <3</p></body>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2F1JMTPZYb%2Frec-Mzm4xy-OTAIOUv8-jpg.png",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-05T17:00:00.000Z",
      "name": [
        "Mandy"
      ],
      "photo": [
        "recfCkG7cdGG2OAVU"
      ],
      "name_photo": [
        "Lauren Matz"
      ],
      "createdAt": "2025-04-19T21:59:55.030Z",
      "hashtags": "fghj"
    },
    {
      "id": "recRn2sFqOabi55fd",
      "title": "Hey! My Friend Over There, Dingus Dorkus, Thinks You’re Cute ",
      "description": "Sometimes your crush is really your pimp. Cause there are no crueler words than “I think you would really like my friend over there.” ",
      "content": "<body><p>Like a biblical ray of sunshine struck your phone, a text from your crush. <em>Yes! I would love to go to a party with your friends… in fact, I would love nothing more.</em> And then we can hang out the whole night, and talk, and laugh, and kiss a little bit, and fall in love, and marry, and buy a Victorian fixer-upper home, and a few dogs, and live happily ever after.</p><p>But sometimes your crush is really your pimp. Cause there are no crueler words than <strong>“I think you would really like my friend over there.”</strong></p><p>The friend is never <em>nor/mal</em>. They always have jacked-up eyeliner. A tooth waiting to get snagged on any loose-fitting clothing. Incurable halitosis. When someone tries to set you up with a friend, odds are that person is a homeschooler, hellbent on proving the statistics saying they’re “unsocialized” wrong. In other words, the friend is <strong>Dingus Dorkus</strong>.</p><p>So maybe you go sit next to Dingus Dorkus for a while. I mean, it’s only polite. They make sure you’re aware this is one of their first <em>“drinking parties.”</em><strong>Sigh.</strong> You could just say <em>“party,”</em> you know? They share the big things happening in their life with you; tap recital is next weekend! I guess it makes sense that they would do the tuxedo t-shirt of dance.</p><p>But after a while, chopping it up with Dorkus turns from boring to anger-inducing. Because, at the end of the day, the shadiest thing someone can do is set you up with their weird friend. <strong>Why do you think I would fuck with finger-guns incarnate over there?</strong> How can I date someone who would ask, <em>“Can I Haz Cheeseburger?”</em> when I take shawty to Shake Shack? What about me makes you think I also <strong>fucking loveeeee cosplay?</strong> All this time with Dingus Dorkus really makes a girl look inward.</p><p>And that’s the sad truth of it. Because after the anger of being set up with someone who has a Twenty One Pilots tattoo subsides, you’re left with the realization that Dingus Dorkus is probably the nicest person at this party.</p><p>But you’re still not gonna hit tho. <strong>Sorry Dingy.</strong></p></body>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FVW6JJGmW%2Frec-Rn2s-Fq-Oabi55fd-jpg.png",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-04T18:02:00.000Z",
      "name": [
        "Maggie McNeir"
      ],
      "photo": [
        "recNrwwoaPVdgg85g"
      ],
      "name_photo": [
        "Via Sznewajs"
      ],
      "createdAt": "2025-04-19T21:59:55.031Z"
    },
    {
      "id": "reccvb6PlIVfxtpN2",
      "title": "Trump Ordinance Working??? Straight Up Not Feeling Nonbinary These Days",
      "description": "One morning I woke up covered in fluid.  Pants? Soaked. Bed? Soaked. My boyfriend? Soaked. What is this mysterious fluid? I wondered to myself. Then I realized: Holy shit– it’s my gender fluid. \n",
      "content": "<p id=\"\">Trump Ordinance Working??? Straight Up Not Feeling Nonbinary These Days :/</p>\n\n<p id=\"\">One morning I woke up covered in fluid. Pants? Soaked. Bed? Soaked. My boyfriend? Soaked.</p>\n\n<p id=\"\">What is this mysterious fluid? I wondered to myself. Then I realized: Holy shit– it’s my gender fluid.</p>\n\n<p id=\"\">I tried to mop up as much as I could to save my precious nutrients, but it was no use. I felt… dry. 😞 Suddenly I sat up and checked my phone. I had to get to the bottom of what was going on with me. That’s when I saw it. Trump signed an executive order stating there are only two genders.</p>\n\n<p id=\"\">I start to spiral. I’ve been nonbinary for so long I don’t even remember what my gender assigned at birth was. I quickly pull down my pants to check what is between my legs and find something so disturbing it’s hard for me to write.</p>\n\n<p id=\"\">I am completely smooth.</p>\n\n<p id=\"\">I screamed for a minute straight. This can’t be. Literally how am I supposed to jork it now????</p>\n\n<p id=\"\">I fall to my knees, pounding the floor with my fists when I realize I need to harden myself. I rise to my feet with a new sense of purpose– a new mission. I have to castrate Donald Trump.</p>\n\n<p id=\"\">He took my genitalia from me and I must do the same to him. I started out by transferring for my last semester of college to NYU and switching majors to whatever Barron Trump studies. He’s incredibly easy to spot, as I am a million feet tall so my sights are instantly set. I sit next to him in my first lecture and to my surprise he invited me home immediately – seems like a lonely guy tbh. But I’m in and that’s all that matters. I wonder if I should castrate Barron to send a message to Don that I am coming for him, similar to Rosalie from Twilight, but decide against it. Not worth the trauma of having to see his penis.</p>\n\n<p id=\"\">His invite home only extended to his ginormous New York apartment, but I bided my time. Finally, President’s Day of all days arrived. Perfect. Baby Barron was going home to DC for the weekend and I got the invite to accompany him. I packed my soooootcasee and hopped on the private jet to the white house.</p>\n\n<p id=\"\">When we got there to my surprise Barron wanted to introduce me to his parents almost immediately. This was going to be easier than I expected 😏. But to my surprise it was because–</p>\n\n<p id=\"\">What? This can’t be…</p>\n\n<p id=\"\">I watch as Barron gets down on one knee and proposes to me in front of Donald and Melania. I pretend I am speechless when in actuality I am trying to swallow the vomit I am involuntarily regurgitating into my mouth (guess I still have some sort of fluid in me) and nod my head as if I’m Margaret Qualley in the end of The Substance. It pains me to indicate yes, but I have no choice. My mission is my mission.</p>\n\n<p id=\"\">That night we go to bed except I stay up watching YouTube videos on how to castrate someone. I probably should have done this earlier but better late than never. When I finally have a good enough grasp on it I know it’s time to strike.</p>\n\n<p id=\"\">I tip-toe around the white house and find Trump’s room, but when I pull his pants down I’m met with… nothing. What the hell? He is also smooth.</p>\n\n<p id=\"\">I’m walking back to my room with my head hung in defeat when I stumble upon a trap door. Since my mission was a fail and I have nothing left to lose I go in. That’s when I see it. Oh Em Gee. It’s a giant vat of gender fluid! I can get my nonbinary swagger back!!!!</p>\n\n<p id=\"\">I craft an elaborate tubing system that would have made the Romans proud and funnel all of the fluid to the aircraft wing and start dropping gender fluid on the entirety of America.</p>\n\n<p id=\"\">In the morning everyone will wake up nonbinary. God is good. The nonbinary agenda has finally been fulfilled and I can rest easy.</p>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FpjqNhyFt%2Freccvb6-Pl-IVfxtp-N2-jpg.png",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-02-25T17:00:00.000Z",
      "name": [
        "Jaclyn DiMatteo"
      ],
      "photo": [
        "recQWHet2vNmYMXRW"
      ],
      "name_photo": [
        "Maddie lam\n"
      ],
      "createdAt": "2025-04-19T21:59:55.031Z"
    }
  ],
  "timestamp": 1745099995031
}