{
  "data": [
    {
      "id": "recbmrNMi8ZpXXmJE",
      "title": "The Cheese Gambit: Every time I Go to the Bathroom I Must Best A Little Mouse In A Game of Chess",
      "description": "At this point, I know you, and you know me. And so you should know that I have celiac disease and cannot eat gluten. And that I’m Jewish.\n",
      "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n  <meta charset=\"UTF-8\">\n  <title>The Cheese Gambit</title>\n</head>\n<body>\n  <h1>The Cheese Gambit: Everytime I Go to the Bathroom I Must Best A Little Mouse In A Game of Chess</h1>\n  <p>Hello readers. It’s me, Doran. I’m a junior at this university now. At this point, I know you, and you know me. And so you should know that I have celiac disease and cannot eat gluten. And that I’m Jewish. And that Jews frequently have digestive issues. Because of this, going to the bathroom is something very sacred to me. It’s a place where I can just sit in silence by myself and let loose. Let go of anything that’s holding me down, and just let it flow out of my body.</p>\n\n  <p>So you can imagine how fucking MAD I was when a little fucking know-it-all MOUSE stood blocking the fucking entrance with his stupid fucking chess board and little fucking mouse chess pieces fucking asking me to fucking play or he fucking wouldn’t fucking let fucking me fucking in to fucking shit! <em>(Clearly, mad enough to let the God of middle school boys who just learned to curse take over me. His name is Jason. He’s actually lowkey a ki once you get to know him /srs)</em></p>\n\n  <p>How could this be happening to me? My shit is currently nudging against the interior of my asshole and this other asshole is making me sit down for a nice game of chess! Either way, I had no choice. I had to beat him. And so, I got to work, trying to ignore the reverse sodomy happening down below. Before I knew it, he had lost (of course, like how could I lose to a literal mouse), and I got to have my special time.</p>\n\n  <p>However, as I passed the mouse to go hit the pooper, I heard a little mischievous snicker, “You may have bested me today, but you’ll never finish the whole Cheese Gambit, muahahahaha!!!”</p>\n\n  <p>I for one, don’t take dumb shit like that (I let it go.) so I immediately yelled back, “The Cheese Gambit? Bitch you ain’t Anya Taylor-Joy, you could NEVER be Anya Taylor-Joy. Anya Taylor-Joy would never stop people from dropping deuces, she would respectfully wait for them to drop said deuce and then have a nice game of chess waiting for them when they’re DONE!”</p>\n\n  <p>The mouse gave me no response except for an impish chuckle, as he seemingly strolled away. I then had a very nice shit.</p>\n\n  <p>But the next day, he was there again. And the next, the one after that, and the following day. This continued for weeks, and there was nothing I could do about it. One day, the mouse laughed at me, saying, “oh you’re gonna tell on me? Hah! You think anyone would believe such a ridiculous story?”</p>\n\n  <p>“You’re right,” I said. “No one would believe I’m playing a little mouse in chess.”</p>\n\n  <p>“HAH! No! I meant, no one will believe that you’re beating me, fucko!”</p>\n\n  <p>This cycle continued for 40 days and 40 nights, the games getting harder each time, until one night, it wasn’t just him. 80s of mice sat behind him clapping their hands rhythmically as I walked up to the board to gain passage as he sat there with a crown of cheese on his head, opposing me.</p>\n\n  <p>“You have company this time. And a new hat,” I noticed.</p>\n\n  <p>The mice all abruptly stopped clapping, and he looked at me in shock.</p>\n\n  <p>“You do realize that every mouse you’ve played has been a different mouse, right? Like, I’ve never played you before. I’m the Cheese King, the best chess player in the land.”</p>\n\n  <p>I stared at my adversaries in shock of this news. I had no clue. But what I did know was that I had to shit reaaal bad. So I got to work again.</p>\n\n  <p>The game was intense. I almost lost. He was struggling. And each time he did, he would take a little nibble out of his crown. But right near the end, the spirit of Anya emboldened me to make the necessary decisions to come out victorious. I cheered. The mice cried. I had finally defeated these evil mice, and could now poop freely! The mice couldn’t believe it, and the Cheese King placed his crown on my head. I gladly accepted the honor, and continued passage into my safe space.</p>\n\n  <p>Eyes closed, taking it all in, I sat down on the toilet, hearing the cries of the mice outside.</p>\n\n  <p>“Hey hoststuff, need a hand?”</p>\n\n  <p>I turn and jump up in shock, the shit literally being scared out of me, as I see my best friend, Olga Syphil, sitting on a toilet facing me that I’ve never seen in my bathroom before in my life.</p>\n\n  <p>“Let’s drop that dookie together now, shall we? One, two, three, Squeeeeeze!”</p>\n</body>\n</html>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FkgPkpMSW%2Fcheese-gambit-1-png.png",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-09-21T14:05:00.000Z",
      "name": "Doran Steinfeld",
      "photo": "",
      "status": "published",
      "createdAt": "2025-09-22T21:17:19.162Z"
    },
    {
      "id": "rec6rPIDoZBeteIPC",
      "title": "Dear Seniors: Only 3 More Weekends to Quit Your College Alcoholic Tendencies",
      "description": "Say yes to Senior Spring! Except like. Hey. This is an intervention. You say yes every chance you get. You have been slightly tipsy for the past 12 weeks. You have a problem.\n",
      "content": "<html><head><meta content=\"text/html; charset=UTF-8\" http-equiv=\"content-type\"><style type=\"text/css\">ol{margin:0;padding:0}table td,table th{padding:0}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:\"Arial\";font-style:normal}.c0{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c3{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:\"Arial\"}p{margin:0;color:#000000;font-size:11pt;font-family:\"Arial\"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class=\"c3 doc-content\"><p class=\"c2\"><span class=\"c1\">Say yes to Senior Spring! Except like. Hey. This is an intervention. You say yes every chance you get. You have been slightly tipsy for the past 12 weeks. You have a problem.</span></p><p class=\"c0\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">But hey! We aren&rsquo;t here to judge or make jokes about alcoholism. It is super serious, and you should never be afraid to ask for help. For the sake of this article, however, you are not technically an alcoholic. You&rsquo;re just in college.</span></p><p class=\"c0\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">As the semester comes to an end and you gear up to put on that bright Boston University Red robe, you have got to make every last drink count. You have to get it together. Face reality: You don&rsquo;t need the drunk ciggies. You&rsquo;re going to end up getting hooked, and let&rsquo;s be serious, you are too young and far too privileged to have to take advantage of smoke breaks at work. What you need is a juice box and time outside, watching the blades of grass sway in the wind.</span></p><p class=\"c0\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">&nbsp;</span></p><p class=\"c2\"><span class=\"c1\">You don&rsquo;t need to drink before everything&hellip; But it sure is fun! Anything can be pre-gamed if you believe in it hard enough. So make sure to pregame your last classes and club meetings. You can take a shot right before Senior breakfast. Hell, bring a borg to commencement! </span></p><p class=\"c0\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">But make sure that when you wake up on Monday, May 19th, preparing to drag a yellow cart through the halls of your dorm or end up stuck in traffic with your entire family as you prepare to drive for hours, those tendencies are out of your system. You will no longer have the urge to mix vodka with any non alcoholic beverage you can find. You will no longer lose count of how many shots you&rsquo;ve taken during a night out. You are an adult and you have only so many years left on your parents&rsquo; health insurance, and getting your stomach pumped is not cheap.</span></p><p class=\"c0\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">For these next three weekends, make sure you are getting as white boy wasted, Channing Tatum, as is possible (Megan Thee Stallion reference). But be mindful about it. Understand that this is the peak. Life gets worse after this. So let&rsquo;s get crazy crazy crazy till we see the sun&hellip; I know we only met, but let&rsquo;s pretend it&rsquo;s love&hellip; and never never never stop for anyone&hellip; tonight let&rsquo;s get some, and live while we&rsquo;re young (One Direction reference).</span></p></body></html>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FnqJgF1QP%2FDear-Seniors-WEBSITE-1-png.png",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-05-02T12:30:00.000Z",
      "name": "Ogenna Oraedu",
      "photo": "recQWHet2vNmYMXRW",
      "name_photo": "Maddie lam\n",
      "status": "published",
      "createdAt": "2025-09-22T21:17:19.162Z",
      "hashtags": "Say yes to Senior Spring! Except like. Hey. This is an intervention. You say yes every chance you get. You have been slightly tipsy for the past 12 weeks. You have a problem.  But hey! We aren’t here to judge or make jokes about alcoholism. It is super serious, and you should never be afraid to ask for help. For the sake of this article, however, you are not technically an alcoholic. You’re just in college.  As the semester comes to an end and you gear up to put on that bright Boston University Red robe, you have got to make every last drink count. You have to get it together. Face reality: You don’t need the drunk ciggies. You’re going to end up getting hooked, and let’s be serious, you are too young and far too privileged to have to take advantage of smoke breaks at work. What you need is a juice box and time outside, watching the blades of grass sway in the wind."
    },
    {
      "id": "reck1otRde60Hljyg",
      "title": "The Subtle Art of Getting Old Men Online to Gift you Convenience Points",
      "description": "Picture me– in bed. I haven’t washed my bedding in months. Boston University is bleeding me dry, and each day I find myself caught between a rock (laundry) and a hard place (chai latte). The choice is obvious. I get a ding on my phone. \n",
      "content": "<style>\n    body {\n      font-family: Georgia, serif;\n      line-height: 1.6;\n     \n      background-color: #fdfdfd;\n      color: #333;\n    }\n    blockquote {\n      font-style: italic;\n      color: #666;\n    }\n  </style>\n</head>\n<body>\n\n\n  <p>Picture me– in bed. I haven’t washed my bedding in months. Boston University is bleeding me dry, and each day I find myself caught between a rock (laundry) and a hard place (chai latte). The choice is obvious. I get a ding on my phone.</p>\n\n  <blockquote>“Ding!” it dings.</blockquote>\n\n  <p>Picture me– in bed. This old man who just followed me on Instagram certainly is. Probably a scammer. Maybe true love. Possibly a lonely, independently wealthy soul looking to spend the rest of his days financially supporting someone who exclusively posts pictures of herself in sunglasses and seasonally-inappropriate layers of clothing.</p>\n\n  <p>After methodically liking each and every single one of my posts, the man (<strong>Kenneth</strong>) sends a message. <q>Hello dearest beautiful. I would like to get to know you and send allowance of 300$ monthly.</q></p>\n\n  <p>Well, that sounds good to me. I send back a classic, tasteful back-of-knee fake cleavage pic. We don’t use AI for our catfishing around here. We do it purely for the love of the game.</p>\n\n  <p>He responds, <q>Beautiful send routing number and account number.</q></p>\n\n  <p>Not so fast Kenneth. Now if I'm to sell my body (knee), I’ll do it for the currency that I damn please. The one that best suits my current, desperate need for laundry money.</p>\n\n  <h2>Convenience points.</h2>\n\n  <p>Luckily the BU gifting system makes it easy, dare I say convenient, to get “parents, family, and friends” to digitally send you money in the form of convenience points. I’d say Kenneth is eligible.</p>\n\n  <p>Unfortunately, the next step requires giving Kenneth my BUID. But what’s the worst he can do? Turn in my missing assignments on Blackboard? Pay my 6-months-overdue fall tuition balance? Use Handshake™ to schedule a zoom call with my advisor? If that's what’s getting him off, hey… Kenneth is welcome to do all of the above.</p>\n\n  <p>I ponder how much money he’ll send over. Will he stick to our agreed upon 300? Give me a little extra to save for a rainy day? Or maybe he’ll appreciate the boldness of my fake cleavage picture and pick the auto-select option of 1500$.</p>\n\n  <p>You know, a normal amount to be transferred anonymously from someone’s bank account to cold, hard convenience points. Now, while I’m firmly a lifestyle columnist and have no interest in investigative journalism, I have a strange feeling that students' clothes aren’t the only things being laundered here….</p>\n\n  <p>But hey, that’s besides the point. Why shouldn’t a loving, wealthy parent or a strange digital old man give me 1500$ to use on overpriced vending machines, broken laundry machines, and CityCo sushi?</p>\n\n  <p>I’m getting ahead of myself. With only minor hesitation, I send the gifting link and my BUID number to Kenneth, awaiting the days ahead. Days full of fresh linens, chai lattes, and joy.</p>\n\n</body>\n</html>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FHm3fS68%2FThe-Subtle-Art-of-Getting-Old-Men-Online-to-Gift-you-Convenience-Points-JPEG.jpg",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-04-23T12:31:00.000Z",
      "name": "ā̶͖̮̯̙̦̻̬̜͇͕̀̽̓̏̈́̏̓̄n̵̬̔̐o̷̱̯̳͔̱̒͗̇̇ͅn̸̛̤̰̈́̓̒̓͊̈͆̏͠y̸̨̢̰̠̳̝͚͈̙͉̒̀̑̔͆̅̏͝m̶̤̾̒̈́͆͋̈o̶̡̨̘̺̘̣̎͐̀̈̕͜͠u̸̬̬͈̺̩̺͎̐̃ś̴̛̛͖̺̠̼͎͛͒͐͌͆̚",
      "photo": "",
      "status": "published",
      "createdAt": "2025-09-22T21:17:19.162Z"
    },
    {
      "id": "rec7hS0r7SWLoKJm0",
      "title": "Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior\n\n",
      "description": "Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior\n\n \n",
      "content": "<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\" id=\"docs-internal-guid-8dbea941-7fff-3c39-83b2-54a85db1a595\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span style=\"-webkit-text-decoration-skip:none;font-style:normal;font-variant:normal;font-weight:400;text-decoration-skip-ink:none;vertical-align:baseline;white-space:pre-wrap;\"><u>Trump Appoints Mesoamerican God of Rain, Quetzalcoatl, As Head of Dept. of Interior</u></span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">Fear not liberals, for reason and order are back in the White House. No more are the days of chaos and appointing mortal beings with no superpowers. This week, President Trump used his imagination to break boundaries from the Oval office, appointing Mesoamerican God of Rain, Quetzalcoatl (pronounced quet-sal-coa-tal), as Head of the Department of the Interior. Coatl had been on hiatus since 1519, when he was responsible for scaring the Aztecs into believing the Spaniards were white colored Gods (this part is not satire, that’s actually real). Trump touted Quetzalcoatl for such a successful propaganda campaign and white supremacist fundamentalism.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">Now before I continue, I know you readers have no idea what the Department of the Interior does. No yea, you claim to love political satire but don’t know how the government works. Sigh. Lemme dumb it down for you. No, it doesn’t build IKEA furniture or put up decorations. It basically just manages our land, resources, and maintains trusts with Native Americans tribes. Unfortunately, Pew Research Center has rated this department as the “most boring department.” A perfect place to finally spice things up.</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">As Head of the Department, Queztalcoatl promises that all of our sacrifices will not be in vain. His first plan was to take detained undocumented immigrants, and make the fight to the death against American citizens. The winner of the fight to the death would be deemed worthy of sacrifice to the Gods (again, this is real, I did my research). This would bring at least 7 months of rain, providing full harvests of maize. Wow! Sacrifices would have to take place somewhere important enough for the Gods. Quetzalcoatl proposed putting a guillotine on the Lincoln Memorial.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">The opposition response has been mixed. Former Speaker of the House and resident girlboss Nancy Pelosi stated that she is worried about sacrifices overall. “While I think it's good Trump hired an immigrant who is also indigenous, how will human sacrifice help my investment portfolio?” This appointment also comes with Quetzalcoatl’s initial statement: “Niuil noyuki ka anilitika okse teomeh nik in office” which translates to “Biden will be sacrificed first.”</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">His last announcement as a new appointee was to announce his deputies of the department, which every department is allowed to do. After being chosen so decisively, political experts predicted that the choice would calm politics, mainly a evangelical christian states man (white most likely), which would quell worries of a foreign, once believed dead, Meso-american god. However, in a shocking move, he appointed Lord Yama, the Hindu god of hell. Yama’s previous experience includes running the Gates of Hell Inc. for about 4,500 years. Despite his short experience as an executive, his record is fairly impressive in keeping hell working for so long.&nbsp;</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;text-indent:36pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre-wrap;\">What will this mean for the interior of America? Well, the expert opinion is still unsure. But what we can expect from the Trump Administration is more appointments that are out of this world. Trump seems to have moved on from the sexual abusers, sexist, alcoholics, Oil tycoons, wrestling ceos’ concubines, and other bootlickers. In exchange, Trump's search for power has now reached mythical proportions. Stay tuned as the Pinky Toe covers this very real story.</span></span></p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span></span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p style=\"line-height:1.38;margin-bottom:0pt;margin-top:0pt;\" dir=\"ltr\"><span style=\"background-color:transparent;color:#000000;font-family:Arial,sans-serif;font-size:12pt;\"><span class=\"Apple-tab-span\" style=\"font-style:normal;font-variant:normal;font-weight:400;text-decoration:none;vertical-align:baseline;white-space:pre;\"> </span></span></p>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FPZM1R536%2Frec7h-S0r7-SWLo-KJm0-jpg.jpg",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-10T12:02:00.000Z",
      "name": "Martin Akamine",
      "photo": "recNwxpWgzmS6Ts1F",
      "name_photo": "Elizabeth Morearty",
      "status": "published",
      "createdAt": "2025-09-22T21:17:19.162Z"
    },
    {
      "id": "reckZsvL5sxi3Iut7",
      "title": "Rating Each School by How Good Their Track Runners Are in Bed",
      "description": "I have a knack for sleeping with guys on sports teams. The only time I have ever caught balls was with my mouth. I hit a home run almost every weekend if you know what I mean. I have only ever hit cardio when riding is involved. I only run when I know a hunk is waiting for me at the finish line. Needless to say, I feel like I know Boston track stars pretty well. \n",
      "content": "Rating Each School by How Good Their Track Runners are in Bed \nRachel Stern \n\n\n“I’m a runner I’m a track star” - Mooski\n\nI have a knack for sleeping with guys on sports teams. The only time I have ever caught balls was with my mouth. I hit a home run almost every weekend if you know what I mean. I have only ever hit cardio when riding is involved. I only run when I know a hunk is waiting for me at the finish line. Needless to say, I feel like I know Boston track stars pretty well. \n\nHere are my rankings of teams that have crossed the finish line: \n\n5. Boston College: UGH. NO. Boston College is only good for 2 things, football and hockey. Now THOSE MEN know how to do it. But their track team?? Those fake Bostonians have me faking it. \n\n4. Tufts: The good-boys of the track-sex intersection. They just want to be told they are doing so great. An inordinate amount of them are still in love with their Christian high school ex-girlfriends, but this makes them incredible in bed. While not kinky, they will kiss your forehead and blush at praise. \n\n3. MIT: Boyfriend Dick. The perfect Goldilocks porridge. With the right amount of stamina and size, it always gets the job done. Are my legs shaking after? No, this is a marathon, not a sprint. But am I always satisfied? Yes, it is a beautifully average experience. \n\n2. BU: Kinky sex. Yum. \n\n1. Harvard: I hate to say it, but Harvard is my number 1. This is a race that leaves me breathless, legs shaking, sweat running, blown away. I didn’t know that daddy’s money could buy you good dick, but maybe I should have known that. Every time I go to a Harvard track event, I know I am getting it good. If only their legs could outrun their ego. \n\nThere you have it!! These are the men that have run right through my heart and straight to my pussy. I have never been so good at running, but maybe I should give the long jump a try since I seem to leap to conclusions. Have I mentioned that I accidentally fell in love with each of these men throughout my time in Boston? Anyway… more updates to come! Next up: I’m going to shoot my shot with basketball teams. ",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fi.ibb.co%2FQvP52q8H%2Freck-Zsv-L5sxi3-Iut7-jpg.jpg",
      "imageType": "url",
      "imagePath": null,
      "featured": true,
      "publishedAt": "2025-03-09T12:03:00.000Z",
      "name": "Rachel Stern",
      "photo": "recZDtJSX5KOLTgH4",
      "name_photo": "Lindsay Lee",
      "status": "published",
      "createdAt": "2025-09-22T21:17:19.162Z"
    }
  ],
  "timestamp": 1758575839162
}