{
  "data": [
    {
      "id": "rec6gPXThviMQGrCp",
      "title": "Cunty ",
      "description": "Cuntry ",
      "content": "<h1> Country Cunt </h1>",
      "contentFormat": "html",
      "imageUrl": "",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-25T16:36:49.859Z",
      "name": [
        "Jawed Nur "
      ],
      "photo": "",
      "createdAt": "2025-03-25T20:18:21.969Z"
    },
    {
      "id": "recW5HnXSUGwtT1aP",
      "title": "This Feels Like a Metaphor: Walking Home on Thin Ice Carrying $10 Eggs",
      "description": "Hm… Egg in hand, ice beneath foot, Olga on phone. Something’s wrong. I look around. I look up. I look down. I look at the eggs. ",
      "content": "Hm… Egg in hand, ice beneath foot, Olga on phone. Something’s wrong. I look around. I look up. I look down. I look at the eggs. There’s a receipt hiding in my fingers. I lean down with my mouth to snatch it, and as I do, I slip. Oops… Must be more careful. I carefully take a peek at the receipt. \n\n$10 Eggs?! \n\nIn shock, my foot slides up on the slippery ice, and I begin to fall. As I fall, I pray to the Gxd of Pity to practice their ways and protect me. As I do, the divine intervention does exactly that and protects the most important, valuable, and expensive thing: the eggs. The eggs float in the air as I crash down into the thin ice, breaking it. Shards fly up my spine and snuggle in my asscrack. A stunning moment of divinity. As I lay there staring up at my fortune floating above me, I hear the laughter echoing from my best friend, Olga Syphil, who is still on the phone for some reason. \n\nAs the stars and birds flying around my head dissipate, I manage to sit up, which unfortunately only pushes the shards further up my ass (it’s okay, I don’t mind, I was born for this) despite the fragility of the frozen water.\n\nI look back at the store from which I came. Target. I knew I shouldn’t have bought something from that sellout company. Fuck Target and their weak-ass DEI rollbacks. I should’ve gone to Trader Joe’s. They would never have allowed me to slip on this ice. \n\nBut what’s done is done. I stand up (the shards in my ass now melted, dripping down, as if I was just doing colonoscopy prep and pee shitting from my ass), grab the eggs, and thank the Gxd of Pity. \n\nBut something’s still wrong, I can sense it.\n\nI open the carton of eggs, and to my horror, I realize that the worst thing has come true. They were fertilized. Great. Now I have to not only spend money on expensive ass food for myself, but I also have to spend a fortune to raise a dozen little chicks. Fuck my stupid baka life. \n\nBut then I look around and think (something that they don’t want you to do) and my mind begins to open and awaken.\n\nCould this experience be… a metaphor?",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2F8UxYwlZB0S2NWje8iK0dpQ%2FyZFQdZct-dC4nNwAEtmBbqP_sM-T4uQlXVRJqDtpnaqASyuwWaKl8CXsbwlTHVrhysFvVKdO2I8MFT3DDep2ASabQc7THOB40ixp1oIT1ixGunVRWm-B9wYcESEFBdVnhbTM8c4fSrqNEsfIXVrBRQ%2Fc3ReSfOafKmAoj71b34jilPJOMp9mkUJWNRhyR-lvUs",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-21T15:09:00.000Z",
      "name": [
        "Doran Steinfeld"
      ],
      "photo": [
        "recNwxpWgzmS6Ts1F"
      ],
      "name_photo": [
        "Elizabeth Morearty"
      ],
      "createdAt": "2025-03-25T20:18:21.969Z"
    },
    {
      "id": "recqkxTgFd50gZVYa",
      "title": "That’s So True, I Know the End: My Application To Be Paul Mescal’s Next Victim",
      "description": "As we are coming off of the St. Patrick’s holiday weekend, I’d like to give an encore to our favorite slutty chain-wearing Irish man Paul Mescal. ",
      "content": "<p>As we are coming off of the St. Patrick’s holiday weekend, I’d like to give an encore to our favorite slutty chain-wearing Irish man Paul Mescal. Growing up, I was a Niall Horan girl, but then I really resonated with the synopsis of <em>Normal People</em>. The iconic scene when Marianne asks if Connell has talked to other girls at uni and he’s like—I'm literally still inside you—I realized that that’s something I would do. I think the perfect way for us to meet would be by both of us getting cast in a Jenny Han production, the author of <em>To All the Boys I’ve Loved Before</em> and <em>The Summer I Turned Pretty</em>, since I can seamlessly play the role of another half-Asian girl getting fucked over by a white man.</p>\n\n<p>The following are some of my qualifications for being Paul Mescal’s next victim:</p>\n\n<ul>\n<li>Brunette</li>\n<li>Ignores red flags</li>\n<li>Will forgive you easily</li>\n<li>We are probably the same pants size</li>\n<li>>10 years of experience with white men letting me down (possibly can try to get a letter of rec from one of them)</li>\n</ul>\n\n<p>Mescal is obviously in love with Daisy Edgar-Jones. That photo of him with Phoebe Bridgers at the Met Gala contributed to my childhood trauma. I didn’t imagine that his cruelty would continue onto Gracie Abrams, but then I realized he is coming for that whole friend group.</p>\n\n<p>Gracie Abrams has been seen with bangs, so the rumors are just getting stronger. I may not have abs like hers, but I am great at falling for men who don’t want me. I can’t rock the fuck-ass bob either, but if he needs me to get bangs, I’ll do what needs to be done. Now that Julien Baker and Lucy Dacus are confirmed to be dating, he can’t conquer the entire friend group. Another reason I am willing to victimize myself for Paul Mescal is because I feel the need to protect Ayo Edebiri at all costs. After I saw that photo of them together on my feed, I worried for her safety and my sanity. If he is going to keep not admitting his feelings for his one true love, I might as well have some fun and let him hurt me for the plot. Whatever happens, we will be getting a Gracie Abrams album out of it. So Paulie baby, come and get it! I’m ready for you to ruin my life.</p>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2Fe5tSFmr1WlHvgw1L_QSHTQ%2Fatu0emt5qtCoJcnvIdjbyQugb6cqikm3JibZ6jExJZWjDOja4-mO8Ggr3mN8siIYgHH48pGo-103HoJteuw4HCL2yhLNCIVAfKOQf6AZ6o-bdPS448LhShYi0kgFj_QW3LBjHsjOGXEm5N66J-UvQw%2Fodl9-eXOW9VlA-uEgXn8E6wZ2L2DSyDHSfIeDdDMjuA",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-20T16:43:00.000Z",
      "name": [
        "Elana Felig "
      ],
      "photo": [
        "rec1PJwtCdLh6gGOy"
      ],
      "name_photo": [
        "Katherine (Katie) Reilly"
      ],
      "createdAt": "2025-03-25T20:18:21.970Z"
    },
    {
      "id": "recRBoofsKHcgXYIv",
      "title": "How To Handle Dictatorships And Dick-tatorships ",
      "description": "Surprise! They are the same thing.",
      "content": "<p>Surprise! They are the same thing. As far as ego and unrealistic perceptions of the self go, dick-tators and reigns of terror are caused by the same fundamental “shortcoming.” Those in power lack a certain je ne sais quoi which ultimately causes catastrophic repercussions felt throughout the nation. No matter the country, there will always be a rather unsavory explanation for the gradual demise of democratic systems.</p>\n\n<p>It can be quite discouraging to find yourself as a tiny sheep so carelessly being herded around by the big bad wolf. Here are three expert tested suggestions to get through trying times and ridiculous autocracies:</p>\n\n<p><strong>Cut it off</strong><br>\nMove to another country! People always say they will do it but have you actually tried to? Europe is practically begging people to move back after making all those mistakes for hundreds of years. You can actually be financially compensated for your decision in some countries, including Italy and Switzerland. Pasta and cheese with holes all day? Say no more!</p>\n\n<p><strong>Plead for growth</strong><br>\nWith all the technological patents and companies your dictator owns, surely your dictator will have figured out how to turn this shortcoming into the next Terminator. Once the sad shrimp turns into a techno tank, everyone's problems will be solved and there will be no need to uproot your entire life.</p>\n\n<p><strong>Introduce Organic/Non GMO Options</strong><br>\nIf the suggestion above does not yield favorable results and ChatGPT fails to give the correct instructions to fix the issue, pass on the idea of natural healing. With the proper levels of phosphorus and enough sunlight to induce photosynthesis, perhaps Danny Devito in the seminal role of the Lorax will speak for us after all: “unless someone like you cares an awful lot, nothing is going to get better, it's not.”</p>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2FKNgz4EHD2nznfzuMXoEDmQ%2FX4gOYwBTdrY0LOqd5htTfG2sJDOAmRT4BFYC-0QSTOacVs8b_BSHGqllDU1cY4dcEvrOB2kRyx6igyIgUQ30iHQkzlo5XIdXGO7KQLTHvq0gJeAAICCc5XoOXYTEHnxr4bmFM5D7A6swFjmCG2ZDPg%2FYtsWUJ86bYjPAr1AI-nHju0tx6HSeqrmpYLe-PEnPCE",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-19T15:17:00.000Z",
      "name": [
        "Willa Norvell"
      ],
      "photo": [
        "recNrwwoaPVdgg85g"
      ],
      "name_photo": [
        "Via Sznewajs"
      ],
      "createdAt": "2025-03-25T20:18:21.971Z"
    },
    {
      "id": "recdaDlsxX43yuP7h",
      "title": "Who Will Die First, The Pope or That Bitch From Discussion. (Depends if I Can Get a Glock)",
      "description": "Man, the Pope really used to be cool before he was on the brink of death. Remember during the pandemic when he would use a water gun to spray his special liquid everywhere … yeah I think it’s called holy water. (this article might be really offensive, I forgot I’m Jewish).\n",
      "content": "<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Man, the Pope really used to be cool before he was on the brink of death. Remember during the pandemic when he would use a water gun to spray his special liquid everywhere … yeah I think it’s called holy water. (this article might be really offensive, I forgot I’m Jewish).</span></p>\n<p style=\"text-align:center;\"><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Check out this pope pic:&nbsp;</span></p>\n<p>&nbsp;</p>\n<p style=\"text-align:center;\"><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfM3KnHuVei4CwriFgTDGCVlhzVUsjPqj6CLpmKnP1DsClwIWBdGJ_Llg83u1TI1_KPhqYWiNhyCK0pfzrMAd1i2mHw1CfDPWyXGzGWZLZfbpowKnWEssBjMoDXjtH-AO0plbmafg?key=VnM-9BMtIydzZnnWHEQpU_R2\" width=\"624\" height=\"347\"></span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Okay yeah, so that’s actually not the pope, that's a good old’ priest –&nbsp; like the ones that touch kids!</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Regardless, the pope is really on his last legs which he has 14 of, according to Pinky Toe EIC Ava Carrel. “We pray for his strength as his Holiness has struggled to poop, you know, get one through the gates of heaven,” said Carrel.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Though “pope poop” is confirmed to be a hilarious alliteration, Catholics across the globe are just as concerned for his bowels as they are for me every Tuesday from 8 am to 8:50. Yes, I have gotten a prayer made up just for me, and just to protect against this one bitch (business major).&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">The debilitating number of eye rolls I must complete during this 50 minute block is JUST AS IMPORTANT as the Pope’s livelihood. A couple of times, my eyes have gotten stuck, making the situation significantly worse. Though I have no way of knowing, I could feel the yaper’s jealousy of my bouncing curls and fire outfit (I haven’t washed my hair in a week and I’m wearing a sweatshirt with jeans). In the words of the pope himself “We must pray for bitches, even if it interferes with one’s own swag.”</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Other than his gastrointestinal issues (side note: is the pope jewish?), the pope is named Francis.</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Well not actually, that is just his pseudonym, or what I like to call his “DJ name.” His real name is Jorge Mario Bergoglio or JoMaBog for short (pronounced: HOE, [my] Bawg), which is exactly the phrase I say each morning when I see Bitch. “Hoe, my bog,” I scream with angst as I approach the embodiment of all my high school bullies.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">“The Pope told me I was his favorite comedian.&nbsp; Such an incredible experience. This followed the Pope addressing a room of 200 comedians from throughout the world,” said Jim Gaffigan on</span><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://x.com/JimGaffigan/status/1801656763189432642\"><span style=\"background-color:transparent;color:#1155cc;font-family:'Times New Roman',serif;font-size:12pt;\"><u> X</u></span></a><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">I don’t buy that garbage. You definitely shouldn’t GAF about Gaffigan. If only the pope could hear the creative array of insults I make about The Bitch. They come to me like gay people come to this magazine and rightfully render my intellectual ability nonexistent.&nbsp; I’m sure The Pope’s comedic camaraderie would switch to favor me.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">I’m not sure about The Church’s opinions on manslaughter, but I heard they have some great rifles for sale. Like the cool vintage ones from the Crusades. Or swords I guess. Maybe like nun-chucks?&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Whatever weapon it is, I’m sure it’s not explicitly listed on the course syllabus.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">In an ideal world, The Pope gets to see my good deeds in vanquishing the Bitch and dies immediately after so that way he can poop. Yeah, you poop when you die. According to Conclave, being the pope is super stressful so I’m sure that his last breath of life would cause his body to finally relax, releasing him from the sinful grasps of constipation.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\">Now, you may be wondering,&nbsp;<i>Could The Pope and Bitch be friends?&nbsp;</i>And although I seem to be very informed about both God driven entities, I fear I cannot say. There is no way of telling if they could be friends, however I have recently befriended a modern day oracle known as AI. I think it might be able to help.&nbsp;</span></p>\n<p><span style=\"background-color:transparent;color:#000000;font-family:'Times New Roman',serif;font-size:12pt;\"><img class=\"image-style-align-left\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfNtFYngZDFgjwPVmQ_Gt5ysKeqJNi6F9Anc0Mf4Q7ykYXTHfFdNj5fUGbA0sXF7hE4xKwTsHRdnFWr_0meJ0gd_XV8-uE5XkQVIyprqWcf4GdUWKuj5-rR1TzOI64SkiuyekCGvA?key=VnM-9BMtIydzZnnWHEQpU_R2\" width=\"624\" height=\"327\"></span></p>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2FuD4IeikwckzzCJW7Aw-3LA%2F1u2JcyVkM_oNrK_7w-_n47n2Dacg1anuIWwspLZKHKPG3iW9Hoq2x4ve9VGDheWY-aCCXX0zY7oDM3dAySk106dNyLRurTcJiwbi2VvSEeahsuoFYFBaCwZCiUcka3l1nU1GlmIAsnPRQrduYGP7JQ%2FDoBeKgqUjzMthNYuyAlEV_8OoXa-tUg_Qoftpnfd5kA",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-18T17:07:00.000Z",
      "name": [
        "Ava Rubin"
      ],
      "photo": [
        "recNrwwoaPVdgg85g"
      ],
      "name_photo": [
        "Via Sznewajs"
      ],
      "createdAt": "2025-03-25T20:18:21.972Z"
    },
    {
      "id": "recv0MVsHOGeZDFrD",
      "title": "Ranking Every Trisha Paytas Headline I’ve Pitched In My Tenure at Pinky \n",
      "description": "Trisha Paytas. A name – an icon – that has haunted the general public since the early days of YouTube. Blndsundoll4mj was burned into my iPod Touch’s screen before my rubber panda case could collect dust.\n\nIn between videos of American Girl Doll unboxings, Trisha was a pillar of light in my world. She was a beacon of hope for crazy fat bitches. ",
      "content": "<p>Trisha Paytas. A name &ndash; an icon &ndash; that has haunted the general public since the early days of YouTube. Blndsundoll4mj was burned into my iPod Touch&rsquo;s screen before my rubber panda case could collect dust.</p>\n<p>In between videos of American Girl Doll unboxings, Trisha was a pillar of light in my world. She was a beacon of hope for crazy fat bitches.&nbsp;</p>\n<p>I understand her controversy. I cannot fault her critics. But to act as if a Trisha Paytas Broadway debut isn&rsquo;t the most camp thing of all time is something I simply will not consider. She is modelled of the clay of the early American robber baron &ndash; her money funnelled to support a creative investment never before seen.&nbsp;</p>\n<p>As my time as Pinky Toe contributor comes to a close, I must reflect on my greatest muse. In my nearly four years of pitching articles, Trisha is my number one name. She is the sun in my sky and the ultimate being of creation. I am made in her image.&nbsp;</p>\n<p>I will now take the appropriate time to honor her, in an examination of all my pitches.&nbsp;</p>\n<ol start=\"5\">\n<li><strong> Trisha Paytas&rsquo;s Reformation Means There's Hope For All Crazy Bitches&nbsp;</strong></li>\n</ol>\n<p>Okay, this is definitely my weakest pitch. Yet it resonates. The queer community appears to have embraced Trisha in recent years. Is she crazy or is she just eccentric? We&rsquo;re not sure. But for now she seems to have gained public favor. Always trust in a gorgeous woman&rsquo;s ability to reinvent herself!&nbsp;</p>\n<ol start=\"4\">\n<li><strong> The Worst Person You Know Made a Good Point: Trisha Paytas ASMR Channel&nbsp;</strong></li>\n</ol>\n<p>If your introduction to Trish was a kitchen floor meltdown, Frenemies implosion, or her many appearances on various media, you are likely familiar with her string of controversies. She truly imploded the entire Big Brother UK franchise. She sits at the helm of a multitude of controversies (justly), yet she also produces some of the most calming and creative material for an ASMR channel. She is the Wizard to my Oz.&nbsp;</p>\n<ol start=\"3\">\n<li><strong> POV: You&rsquo;re the Trisha Paytas ASMR Burger King Role Play Watching Me Go To Sleep&nbsp;</strong></li>\n</ol>\n<p>This is based on reality. There are few things that soothe the mind quite like a true Trisha whisper; the early days of Blndsundoll4mj were lush with fields of iphone tapping unboxings and whispered purse show and tells. I&rsquo;m very particular about the ASMR I watch. Not all of Trisha&rsquo;s content makes it to my coveted ASMR playlist, but she is truly an artisan. I&rsquo;m not sure if it&rsquo;s simply due to her burrowing into my mind at age nine or her ever-enamoring representation for crazy, fat bitches, but something about Trisha will always relax me.</p>\n<ol start=\"2\">\n<li><strong> Ranking Each Song From Trisha Paytas 2017 Album Chicken Fingers and Lipo&nbsp;</strong></li>\n</ol>\n<p>This is really an article which haunts me. I purchased the entire album on ITunes within seconds of upload. It was the soundtrack of my life at age thirteen. Imagine my horror to find every song scrubbed from all music streaming services. Freaky was the Abracadabra to my Mayhem. I am begging all Queers to reexamine the biblical texts, Trisha is my Jesus; persecuted unjustly!</p>\n<ol>\n<li><strong> A Star is Born: The World Leader Reincarnated at Trisha&rsquo;s 3rd Baby&nbsp;</strong></li>\n</ol>\n<p>My obvious answer is Trump, but I don&rsquo;t feel like we will be rid of him in nine months time. Another clear winner, the Vicar of Christ himself, Pope Francis. I would argue that a Paytas child wearing the Pope&rsquo;s getup and hat seems nearly certain at this point &ndash; it doesn&rsquo;t feel quite as fun to speculate an already indubitable event.&nbsp;</p>\n<p>So, I would like to propose some alternative reincarnations for the Paytas-Hacmon family. For some reason, I do believe her newest child will be Mao Zedong. He has been dead for some time, but I do feel like Trisha would thrive under the rule of the CCP. If I were to prophesize the next nine months, I would point to a few separate individuals that I think would fit well in the Paytas family tree: Elon Musk, Vladimir Putin, Ron Desantis, and finally, Trixie Mattel. You may be asking yourself, what do these world leaders have in common? The answer is more obvious than you think &ndash; they are all queer butches seeking redemption in their next life. Musk, Putin, Desantis, Mattel: a butch? Yes; these current iterations of their spirit all seek the approval and love of a wider audience, one you may not be tapped into. But I am.&nbsp;</p>\n<p>In summation of these ancient texts, I would like to extend my deepest gratitude for Miss Trish Like Fish. She has served me dutifully in all my pursuits and taught me the importance of plastic surgery. I bide my days waiting to book a lipo appointment and with a picture of her from Eminem&rsquo;s music video for Doctor Miami&rsquo;s inspo. A forever icon, a forever villain; always in my heart.&nbsp;</p>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2F14NZG95nIxnPuZqDwmH--Q%2FHDriuYoJFxyWKT9jqF-2sopz5MehYJX9r6pdeCADdEcR8uhVuPdLYlIPU3koR9Dd0KKn74bkP_cqKfsbXDfuijohSqEC6EdvzAgRPcoOfk8-SNFoWOXY3yCe0jRp1rWirOfWxeI8NK3QjgLScgBsig%2F0B_LD9XABujd2cghrs6wXvycBMduXje40cL5wtmfyDY",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-16T00:27:00.000Z",
      "name": [
        "ā̶͖̮̯̙̦̻̬̜͇͕̀̽̓̏̈́̏̓̄n̵̬̔̐o̷̱̯̳͔̱̒͗̇̇ͅn̸̛̤̰̈́̓̒̓͊̈͆̏͠y̸̨̢̰̠̳̝͚͈̙͉̒̀̑̔͆̅̏͝m̶̤̾̒̈́͆͋̈o̶̡̨̘̺̘̣̎͐̀̈̕͜͠u̸̬̬͈̺̩̺͎̐̃ś̴̛̛͖̺̠̼͎͛͒͐͌͆̚"
      ],
      "photo": [
        "recgqh8EZ6qLEXXsA"
      ],
      "name_photo": [
        "Yara Ahmed"
      ],
      "createdAt": "2025-03-25T20:18:21.972Z"
    },
    {
      "id": "recXfuYm7dCnXCcyF",
      "title": "NARPs And Other Straight People Debates",
      "description": "Recently, a TikTok from a Duke athlete went viral– in the video, he films a student in his class holding a dog and complains about “NARP” behavior. For those that don’t know, NARP stands for non-athletic-regular-person. I don’t know, but I’d say non-student-athletes show some athleticism when they’re dodging athletes’ electric scooters left and right, but whatever.",
      "content": "Recently, a TikTok from a Duke athlete went viral– in the video, he films a student in his class holding a dog and complains about “NARP” behavior. For those that don’t know, NARP stands for non-athletic-regular-person. I don’t know, but I’d say non-student-athletes show some athleticism when they’re dodging athletes’ electric scooters left and right, but whatever.\n\nEither way, it’s a completely useless debate that no sane (gay) person cares about. After all, he was complaining about not being able to watch “football videos” in class, but the dog-holding-girl was paying attention while he was making a Tik Tok so… those low student-athlete GPAs speak for themselves.\n\nAnother thing only straight people care about? Zyns. No self-respecting nicotine addict uses ZYNS. The only context I’ve ever seen Zyns exist in is with frat brothers and male student athletes. Any gay person addicted to nicotine is just going to hit a vape, or even better, go outside and smoke a cigarette (see my Bunion article from today about the drunk cigarette epidemic.)\n\nAnd finally, while I’m complaining about straight people behavior, what the fuck is sports betting? Genuinely who in their right mind sees their paycheck hit their account and decides, “Yeah, I’m going to go gamble this away on a random player and then flood them with hate comments when they don’t score exactly as many times as I wanted them to.” \n\nMen will get mad at their wives for not making family dinner one night to go to book club, but they’re coming home and getting on their computer for FANTASY FOOTBALL?? It allllll comes back to the student athletes. \n\nBut! If you needed something to laugh at today, I received insider information that DraftKings in Boston did give employees Monday the 10th off because of INTERNATIONAL WOMEN’S DAY. They didn’t get President’s Day off, but they got a day off in honor of women.\n\nThat’s allyship, baby!",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2Ff5DcXj3lXPMOTcHbmNFnjQ%2FoGOeb9wQGN_2gUoxydD66Ygl1sDFKKCuecofehCv_5EbOybZI3rysVA-vpCSBZeloCx6BMMQpBnhiBn52999FsuZRcSKj2CRlcKdbhg-DIdMao1x4Xd2qHJG5raWTsdZzW6BO6qOOi9TXKDhVjPosQ%2FPn70BzE0ZkgdVQvEGLWRMVrTRX8nwDRlZLOjtielwLE",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-14T16:00:00.000Z",
      "name": [
        "Lauren Matz"
      ],
      "photo": [
        "recqzeh29YuQiTSz3"
      ],
      "name_photo": [
        "Adrianna Uykan"
      ],
      "createdAt": "2025-03-25T20:18:21.975Z"
    },
    {
      "id": "recRlv2TFb1GLD6CX",
      "title": "Giving back: shaking ass in the club",
      "description": "The club is bumping. The ladies look good. The alcohol is flowing. There is much pain in the world, but not in this room. And yet, derrieres are unmoving and still. ",
      "content": "The club is bumping. The ladies look good. The alcohol is flowing. There is much pain in the world, but not in this room. And yet, derrieres are unmoving and still. \n\nI look around the crowded dance floor, and while there are smiles on faces, something is missing. These people have yet to experience true joy. They have yet to recognize the magic of watching the junk in someone’s trunk move up and down. This place is packed with charity cases, a.k.a men who think they actually have a shot at going home with any of the beautiful young women in here.\n\nWhile they are only successful at scaring the hoes, I still feel bad for them a little. It’s not their fault they lack social awareness, are slightly chopped, and only 5’8. Those were the cards that God dealt them.\n\nSo I do what any good samaritan would do: I put my mid-rise flare jeans to good use and shake what my mama gave me. \n\nOf course, I can only shake so much before the men start approaching. I sense their presence before I even turn around. They are mesmerized by my ability to get low low low low low low low low. But this isn’t a free for all. How can I provide the sensual movements of my bootylicious body to the masses if a handful of freeloaders try to save it all for themselves? I’m backing that ass up for everyone.\n\nAfter six songs and four different men trying to lure me away with the promise of a free drink, I decide that I must have completed enough mutual aid for one night. Community is everything, but I still gotta put me first. My knees aren’t as strong as they used to be, and my glutes are beginning to get tired.\n\nIf you too are double cheeked up and want to know how to give back to your community, try shaking ass in the club. It’s good for the soul, and you might just have some fun along the way.\n\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F39%2F39%2F1742947200000%2FWf3l3Nrx11ZXTslYl2xV2w%2FBwqfcw3CHpesOd2TrBQxFbyPCJ8dtAB9eyS_u9Ll5basA7mzpo0Qq5qtImDWrdxPSK3waGSGxd_r8Wj4nJ1NpCz9wr4VtWgP1bsYdqjTUY630BAlZOmy9HuibPElW3JdYUWip3aHNGPermhntd6Nzg%2FjF09Q-kYjAeRLzhSSImNjr14TqW3PVif0o7P-f_WJa8",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-13T17:33:00.000Z",
      "name": [
        "Ogenna Oraedu"
      ],
      "photo": [
        "recNwxpWgzmS6Ts1F"
      ],
      "name_photo": [
        "Elizabeth Morearty"
      ],
      "createdAt": "2025-03-25T20:18:21.975Z"
    }
  ],
  "timestamp": 1742933901976
}