{
  "data": [
    {
      "id": "rec9VM3surMszV913",
      "title": "Going All Mythbusters® on the Wellesley Lesbian Party",
      "description": " I was left to ask a few questions: Is Wellesley even real? Where is it? How do I get there? Why are there so many Lesbians? How do I get there? What time is The Lesbian Party? How do I get there?",
      "content": "  <style>\n    body {\n      font-family: Arial, sans-serif;\n      background-color: #f9f9f9;\n      color: #333;\n    }\n    h1, h2 {\n      color: #b30059;\n    }\n    em {\n      color: #555;\n    }\n    }\n  </style>\n</head>\n<body>\n\n  <h1>Lesbian Mythbuster: The Wellesley Party Mystery</h1>\n\n  <div class=\"section\">\n    <p>Listen. We all know BU isn’t exactly well known for its party scene. Allston gives us all she can, but at the end of the day, the frats just don’t do it for me! Am I still there every weekend? <strong>Unfortunately, yes.</strong> Pratt Street HATES to see my they/them/thon/thinary<sup>**</sup> ass coming.</p>\n\n    <p>If I’m going to do one thing on a Saturday night, it’s fight my way into a basement with the humidity of the Amazon Rainforest to drink lukewarm cans of Bus(c)h Lite. What ever happened to kegs? <em>LMK.</em> All to listen to the world’s worst DJ spin 2010’s top 100. Coach <strong>PLEASE</strong> put me in so I could do so much better.</p>\n\n    <p>Compared to most schools, BU’s frat guys are actually sometimes kind of woke? But only in the sense that they’re REALLY scared of getting cancelled. Anyways. That’s beside the point.</p>\n  </div>\n\n  <div class=\"section\">\n    <h2>Introducing the Myth:</h2>\n    <p>Welcome to another episode of <strong>Lesbian Mythbuster</strong>, where we bust on her myth till we discover the secrets of the universe.</p>\n\n    <p>It is only in my deepest hopes and dreams that I find myself far far away from Allston (hell) at a Wellesley Lesbian Party. But they’re elusive! I don’t even know where Wellesley is!</p>\n\n    <p>So I was left to ask a few questions:</p>\n    <ul>\n      <li>Is Wellesley even real?</li>\n      <li>Where is it?</li>\n      <li>How do I get there?</li>\n      <li>Why are there so many Lesbians?</li>\n      <li>What time is The Lesbian Party?</li>\n      <li>What kind of music do they play?</li>\n      <li>What’s the address?</li>\n      <li><strong>And...how do I get there?</strong></li>\n    </ul>\n\n    <p>As a person of great scientific inquiry skills, honed through years of experimentation, I did what I do best. I puzzled, questioned, made connections, and investigated.</p>\n  </div>\n\n  <div class=\"section\">\n    <h2>Formulating a Hypothesis:</h2>\n    <p>I hypothesize that Wellesley is somewhere...<strong>West?</strong> This is a vibes based assumption! Also I fear we can’t really go East (Hiii Atlantic Ocean) so I’m ruling that one out.</p>\n\n    <p>Based on the supposedly MAJOR Lesbian population I’m going to take a shot in the dark and say that Wellesley is a historically women’s college. Just a guess! If it’s not then sue me or something. <em>IDGAF!</em></p>\n\n    <p>I fear there might be a secret code of some sorts to get into this Lesbian Party. Perhaps one’s carabiner must jangle at a certain decibel? Or maybe you need a little mullet? A standing account at your local U-HAUL? A treasure map to the Island of Lesbos? (I bet you can’t guess what spot the X marks). Who’s to say! We’ll just have to wait and find out.</p>\n  </div>\n\n  <div class=\"section\">\n    <h2>Experiment Design:</h2>\n    <p><strong>So here’s the plan:</strong></p>\n    <ul>\n      <li>Hop on the commuter rail. Head West.</li>\n      <li>Begin Wandering. I’ll know when I’m where I’m meant to be.</li>\n      <li>Keep my eyes peeled for thumb rings, Clairo haircuts, chunky shoes, outer arm tattoos, and septum piercings. You know, the essentials.</li>\n      <li>See where the wind takes me. Not your usual scientific proceedings, but! What more can I do?</li>\n    </ul>\n  </div>\n\n  <div class=\"section\">\n    <h2>Conducting the Experiment:</h2>\n    <p>The day finally came. I woke and donned my favorite baggy jeans (ft. repaired belt loop following a casualty from carabiner overuse), clipped on my carabiner, and hopped on the train.</p>\n\n    <p>I can’t even lie, I was a little nervy! Who knew what was awaiting me on the other side. But when I stepped off the train it was like the air stood still. <strong>I was home.</strong></p>\n  </div>\n\n  <div class=\"section\">\n    <h2>Analyzing the Results:</h2>\n    <p>Unfortunately, dear readers, I have sworn by blood oath to protect the secrets of the Wellesley Lesbian Party with my life. And as a scientist I simply <strong>MUST</strong> uphold the standard ethical proceedings that come with discovery.</p>\n\n    <p>But what I can say is this: If at first you don’t succeed, try, try, and try again. If it’s meant to be, the Wellesley Lesbian Party <strong>WILL</strong> find you.</p>\n  </div>\n\n  <footer>\n    <p><sup>**</sup>as coined by THE Sage Clark</p>\n  </footer>\n\n</body>\n</html>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2FjICcKoaeb_Gtwj6wmXzhnQ%2F4xXFW_wrGiV66ETKEojwvzRsPxgVDC8Q4e5hToUPsIJYBsl5WKwBalagxVVYViVoVnCg-DI04WvKJzpyrTVsPP4gsjIzyCVi2VLGFgfU9jD6iWtL8NGK5B7MQjeGEPh3dIojH2ZA-qL0wkGSc6b7dw%2FSJCcvqxG6McFZ2oaOgV5HuO68hkFEIiQs2k6pCRuzgs",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-04-10T16:59:30.179Z",
      "name": [
        "Maya Bride"
      ],
      "photo": "",
      "createdAt": "2025-04-11T01:02:27.337Z"
    },
    {
      "id": "recfGgRSmED4MuRce",
      "title": "Woke Out: A Fitness Plan For the Politically Active!",
      "description": "We all have that one darling wokie in our life that we worry about.  You, dear reader, might even be that wonderful snowflake! ",
      "content": "  <style>\n    body {\n      font-family: Lora;\n      line-height: 1.6;\n      background-color: #f9f9f9;\n      color: #333;\n    }\n    h1, h2 {\n      color: #c7254e;\n    }\n    strong {\n      display: block;\n      margin-top: 1.5em;\n      font-size: 1.2em;\n      text-transform: uppercase;\n    }\n  </style>\n</head>\n<body>\n\n  <h1>Woke Fitness Plan</h1>\n\n  <p>We all have that one darling wokie in our life that we worry about. Whether they’re always at a protest, or somehow constantly on the verge of legal trouble, being on the political frontlines is not for the faint of heart. You, dear reader, might even be that wonderful snowflake! Nevertheless, the leftist brigade must stay vigilant, and that includes keeping our bodies healthy and strong to fight the good fight.</p>\n\n  <p>Here are some general guidelines to structure your very own woke fitness plan in these dark, dark times:</p>\n\n  <strong>CARDIO IS KEY.</strong>\n  <p>I’m sorry! Everyone hates cardio, and for good reason–it sucks. You know what sucks more? Wheezing through a KN95 after you yelled just a teensy bit too loud. Watching a 60-year-old cop outrun you after he sat in his car for 8 hours watching YouTube on his laptop. Keep your heart and lungs healthy, your legs strong, and ensure you can actually sprint away if someone yells, “Scatter!”</p>\n\n  <strong>FOCUS ON STRENGTH, NOT GLAMOUR.</strong>\n  <p>Let me be clear: the goal is not to achieve an 8-pack, cum gutters, or beautifully defined back muscles like that one masc lesbian you keep seeing on Instagram Reels. What good will that do you when you’re in full blackout, anyway? Focus on building strength holistically, and try to incorporate the whole body - be as steady as a mountain, as adaptable as the murmuring brook. When the day of reckoning comes, will you be able to hold the line?</p>\n\n  <strong>BE CONSISTENT.</strong>\n  <p>In the same way you show up for your allies, show up for yourself. Rough day arguing with that one lowkey White supremacist in your class? Hit the gym! Half an hour after a rally and you still have pent-up energy you don’t know what to do with? Go for a run! Eventually, fitness will feel like second nature, and one day, you will finally be able to punch an officer of the law and get away with it.</p>\n\n  <p><em>Best of luck with your pursuits, and be on the lookout for a more detailed workout routine soon!</em></p>\n\n</body>\n</html>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2F2YeZsqZ2aGu7-XQ6tP3aDQ%2FUEIXex2MdSZItY9L0JdfH4XYceZ9ibsH4LXje8pGD6tUIv4I4mZ8JGXVgqBvH49RUEhTb0uqQJbMukGeKsuN6Szzzjo1wI4GT99DeLOmudjHY3W0Xn9uchBXfrhklsJFda5in1xyCV2DOubNDciLhw%2FCCmCAM3jwQdtrcikYSZelXhuKiBS2t9ocx1C3F8xAgo",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-04-09T17:34:22.716Z",
      "name": [
        "Claire Zhang"
      ],
      "photo": "",
      "createdAt": "2025-04-11T01:02:27.339Z"
    },
    {
      "id": "recIvqHmrXO8aEfVm",
      "title": "Elon Announces, “If a Guy Has a Bbl It’s Not Gay To Hit It\" Allegedly Referencing Roman Literature",
      "description": "WASHINGTON, DC - During a rally this past Tuesday, Musk announced his new Donald and Elon Intercourse program (DEI). ",
      "content": "<body>\n  <p>WASHINGTON, DC - During a rally this past Tuesday, Musk announced his new Donald and Elon Intercourse program (DEI). This program, claimed to be the first of its kind, will allegedly restore balance to the universe by “promoting manly stuff and memes”.</p>\n\n  <p>While announcing his new DEI plan, Musk said that he was inspired by his studies of Roman literature. Musk in the past has made his inspiration known with his use of the roman salute. Referencing a famous text written by Romulus Augustulus, Elon announced that <strong>“if a guy has a bbl it’s not gay to hit it”</strong>, which he followed by jumping weirdly up and down and snorting ketamine on stage.</p>\n\n  <p>It’s unclear what exactly this initiative entails, as Musk began to quickly derail and talk about his bought league of legends account. However, we were given some details within the 3 hour speech.</p>\n\n  <p>Musk was quoted saying that the program will contain “buttstuff for all manly men” and that “this is how we return America to its genetically pure ways”. He also referred to the bible, a trend common amongst Trump officials, referencing Jermiah 11:11. “SpaceX more like Gay Sex!” Musk shouted, apparently reading from the old testament.</p>\n\n  <p>Other parts of this initiative include free beta-blockers which Musk asserts will get rid of all Beta’s in American society in favor of Omegas.</p>\n\n  <p>He also announced the Butt Plug GDP initiative, a program meant to increase the supply and demand of Butt Plug in order to increase GDP. “This will increase shareholder value by 1000%” claimed Musk, as he snorted another line of Ketamine. Economists are still unsure how exactly this initiative will work, given the current tariffs on sex toys.</p>\n</body>\n</html>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2FiU_26TRaVyaQDZxl6UGAHw%2FDM8NWHX5k0RPyvrvmvkxj1zIq5JwWFKVG_U63OJIlyyp_FYlRwJEeTfHPgQqNyqLSHvuqGRLqhYaXZVoWu8LMRcz7-MqoQUP0--V1WNqpZh7RCsfKKxYle3dLtoJhWksouQCEC3X6hkOjHgtWbAIRg%2FmhKEZOwPwqtrag9Za2QTt8-ae7LkInU6n8S8S8PV4nY",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-04-08T15:57:16.050Z",
      "name": [
        "Marissa Gilbert"
      ],
      "photo": "",
      "createdAt": "2025-04-11T01:02:27.340Z"
    },
    {
      "id": "recfnbE0T0qYfqt9E",
      "title": "I Got Dumped Now I'm Getting Revenge: Dept of Education's Masterclass in Plotting",
      "description": "Good Morning Students! My name is 400 Maryland Ave. SW in Washington, D.C. Street name? The Department of Education.",
      "content": "<p>Good Morning Students! My name is 400 Maryland Ave. SW in Washington, D.C. Street name? The Department of Education.</p>\n\n<p>My story is one as old as time: enter chuzz with a bad haircut. He makes promises, tells stories of how happy we’ll be, then when I ask him to make me official(ly funded) he DUMPS ME IN FRONT OF EVERYONE. And of course all my fans, screen names: NPR, CBS, BBC, are always waiting for the next piece of juicy goss to run with, so my downfall was publicized across the country, Honestly, the only one who even MIGHT understand my experience is Jen Bachelorette when her fiance dumped her then made her watch it back for notes.</p>\n\n<p>A dumpee is only as good as her friends, and luckily mine have been ever so supportive. Bringing me ice cream in bed, giving me their instagram logins to stalk through, and holding nationwide protests in my honor. Actually my friend group (they call us Congress isn’t that sweet! And by “they” I mean the culture) has been holding constant meetings to discuss how I can take back my power, divine femininity and all that, but mostly continue to fund low income schools.</p>\n\n<p>But in the meantime, here is my revenge plan because the American Dream is that chuzz will not prevail. So if you too got dumped, ghosted, or simply are a victim of the situationshepidemic, follow the words of the dumpees who came before you.</p>\n\n<ul>\n  <li>\n    <strong>Expose Their (War) Crimes</strong><br>\n    <p>You might be wondering who I should report this to?? The Twittersphere. While the International Court of Justice has no enforcement avenues, leaving empty words reverberating through a room of the most powerful delegates in the world, the Court of Public Opinion is lawless, ruthless, and funny while they’re at it. You never know when your words may inspire a strapping young man to take action against a billionaire with a backpack and manifesto.</p>\n  </li>\n\n  <li>\n    <strong>Exploit The Ego</strong><br>\n    <p>Invite them to speak at an event, bar mitzvah, career day at school, or national press conference; tell them that everyone is begging to hear their advice on how to impose inefficient tariffs and start trade wars. Fill the room with educated, enraged citizens ready to ask questions like “Does your Tesla tramp stamp mean you should also be deemed a gang member and deported to the notoriously brutal and inhumane prison in El Salvador?” or if they are feeling frisky “Now that you have decreed ‘groceries’ an outdated and offensive slur, what shall we call the food we buy?”</p>\n  </li>\n\n  <li>\n    <strong>Watch The Fire Burn</strong><br>\n    <p>The best part of an evil and stupid ex is that you really don’t need to do much to watch their life go up in flames. They’ll go to light up their apple bong and drop the match all by themselves. Whether it’s insane tariff policies with no plans to build domestic manufacturing infrastructure or spray tanned abs (and body, and face, but not hairline?), they really don’t need any help.<br></p>  </li>\n</ul>\n    \n<p>In the infamous words of the woman who plays Riverdale’s Veronica Lodge: Do Revenge.</p>\n\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2F-3REKZyN6FVupZ5FccWefg%2FMfswNhLYL-CEoeN5U0AAnL_6foD4pXAO1Ht8frC0Tey9IVrgxfjxr2IBwQcAPA6as82Wo68x0S6ecucLK6BssQ6P7CNFXWkThY4_vqAq2RVStoMuyLQbTo1-k63KSvXlQfPCu6A8v4yo94dsU14Wiw%2F0_-5t8LddFZiU67XS18fTDjYmNeE5X_De4_MX92Romw",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-04-06T19:17:39.043Z",
      "name": [
        "Ava Carrel"
      ],
      "photo": "",
      "createdAt": "2025-04-11T01:02:27.341Z"
    },
    {
      "id": "recSeKhpNtcZC98VM",
      "title": "“If You Don’t Want Me, I’ll Just Deem You Gay” and Other Excuses I Make When I Get Rejected (I’m Literally Gay)",
      "description": "Spring has officially sprung and cuffing season has come to an end and I have nothing to show for it except for Snapchat streaks with guys who will never ask me out and crushes I’ll never talk to.",
      "content": "<html><head><meta content=\"text/html; charset=UTF-8\" http-equiv=\"content-type\"><style type=\"text/css\">.lst-kix_ua6875mw8lz1-7>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-7,lower-latin) \". \"}.lst-kix_ua6875mw8lz1-6>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-6,decimal) \". \"}.lst-kix_ua6875mw8lz1-8>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-8,lower-roman) \". \"}.lst-kix_ua6875mw8lz1-5>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-5,lower-roman) \". \"}ol.lst-kix_ua6875mw8lz1-6.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-6 0}ol.lst-kix_ua6875mw8lz1-8.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-8 0}.lst-kix_ua6875mw8lz1-5>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-5}ol.lst-kix_ua6875mw8lz1-8{list-style-type:none}.lst-kix_ua6875mw8lz1-8>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-8}.lst-kix_ua6875mw8lz1-0>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-0,decimal) \". \"}.lst-kix_ua6875mw8lz1-2>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-2}ol.lst-kix_ua6875mw8lz1-6{list-style-type:none}ol.lst-kix_ua6875mw8lz1-7{list-style-type:none}.lst-kix_ua6875mw8lz1-1>li:before{content:\"\\0025cb   \"}ol.lst-kix_ua6875mw8lz1-4.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-4 0}.lst-kix_ua6875mw8lz1-3>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-3,decimal) \". \"}.lst-kix_ua6875mw8lz1-2>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-2,lower-roman) \". \"}.lst-kix_ua6875mw8lz1-4>li:before{content:\"\" counter(lst-ctn-kix_ua6875mw8lz1-4,lower-latin) \". \"}.lst-kix_ua6875mw8lz1-0>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-0}ol.lst-kix_ua6875mw8lz1-0.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-0 0}.lst-kix_ua6875mw8lz1-6>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-6}ol.lst-kix_ua6875mw8lz1-0{list-style-type:none}ol.lst-kix_ua6875mw8lz1-2.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-2 0}.lst-kix_ua6875mw8lz1-3>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-3}ol.lst-kix_ua6875mw8lz1-4{list-style-type:none}ol.lst-kix_ua6875mw8lz1-7.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-7 0}ol.lst-kix_ua6875mw8lz1-5{list-style-type:none}li.li-bullet-0:before{margin-left:-18pt;white-space:nowrap;display:inline-block;min-width:18pt}ol.lst-kix_ua6875mw8lz1-2{list-style-type:none}ol.lst-kix_ua6875mw8lz1-3{list-style-type:none}ol.lst-kix_ua6875mw8lz1-3.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-3 0}ul.lst-kix_ua6875mw8lz1-1{list-style-type:none}.lst-kix_ua6875mw8lz1-4>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-4}.lst-kix_ua6875mw8lz1-7>li{counter-increment:lst-ctn-kix_ua6875mw8lz1-7}ol.lst-kix_ua6875mw8lz1-5.start{counter-reset:lst-ctn-kix_ua6875mw8lz1-5 0}ol{margin:0;padding:0}table td,table th{padding:0}.c3{margin-left:72pt;padding-top:0pt;padding-left:0pt;padding-bottom:0pt;line-height:2.0;orphans:2;widows:2;text-align:left}.c5{margin-left:36pt;padding-top:0pt;padding-left:0pt;padding-bottom:0pt;line-height:2.0;orphans:2;widows:2;text-align:left}.c4{padding-top:0pt;padding-bottom:0pt;line-height:2.0;orphans:2;widows:2;text-align:left;height:11pt}.c2{padding-top:0pt;text-indent:36pt;padding-bottom:0pt;line-height:2.0;orphans:2;widows:2;text-align:left}.c1{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:\"Times New Roman\";font-style:normal}.c6{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.c0{padding:0;margin:0}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:\"Arial\"}p{margin:0;color:#000000;font-size:11pt;font-family:\"Arial\"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:\"Arial\";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class=\"c6 doc-content\"><p class=\"c2\"><span class=\"c1\">Well, look where I&rsquo;ve found myself ending up again. Spring has officially sprung and cuffing season has come to an end and I have nothing to show for it except for Snapchat streaks with guys who will never ask me out and crushes I&rsquo;ll never talk to.</span></p><p class=\"c4\"><span class=\"c1\"></span></p><p class=\"c2\"><span class=\"c1\">In these trying times, we must remember to prioritize ourselves and our own well-being. That&rsquo;s why I&rsquo;m compiling a list of all the delusional things I say to myself to get me through the plethora of one-sided romances.</span></p><p class=\"c4\"><span class=\"c1\"></span></p><ol class=\"c0 lst-kix_ua6875mw8lz1-0 start\" start=\"1\"><li class=\"c5 li-bullet-0\"><span class=\"c1\">&ldquo;If you don&rsquo;t want me, I&rsquo;ll just deem you gay&rdquo;</span></li></ol><ul class=\"c0 lst-kix_ua6875mw8lz1-1 start\"><li class=\"c3 li-bullet-0\"><span class=\"c1\">Ok, we all know what&rsquo;s wrong with this sentence but it&rsquo;s really about energy. If you don&rsquo;t want me, you must not be attracted to my entire gender&hellip;right?</span></li></ul><ol class=\"c0 lst-kix_ua6875mw8lz1-0\" start=\"2\"><li class=\"c5 li-bullet-0\"><span class=\"c1\">&ldquo;My man, my man, my man&rdquo;</span></li></ol><ul class=\"c0 lst-kix_ua6875mw8lz1-1 start\"><li class=\"c3 li-bullet-0\"><span class=\"c1\">If they can&rsquo;t be my man in real life, then why not just make them my man in my head? (Bonus points if you create a false idea of who that person is and get attached to a figment of your imagination)</span></li></ul><ol class=\"c0 lst-kix_ua6875mw8lz1-0\" start=\"3\"><li class=\"c5 li-bullet-0\"><span class=\"c1\">&ldquo;If I was white I&rsquo;d have so many bitches&rdquo;</span></li></ol><ul class=\"c0 lst-kix_ua6875mw8lz1-1 start\"><li class=\"c3 li-bullet-0\"><span class=\"c1\">This one&rsquo;s for my fellow POC baddies. If you get it you get it.</span></li></ul><ol class=\"c0 lst-kix_ua6875mw8lz1-0\" start=\"4\"><li class=\"c5 li-bullet-0\"><span class=\"c1\">&ldquo;We gonna keep playing eye tag, or you gonna holla at ya boy?&rdquo;</span></li></ol><ul class=\"c0 lst-kix_ua6875mw8lz1-1 start\"><li class=\"c3 li-bullet-0\"><span class=\"c1\">I mean if I stare at him creepily in class and we make eye contact for two seconds it totally means they&rsquo;re into me? They don&rsquo;t think I&rsquo;m some creepy stalker or anything.</span></li></ul><ol class=\"c0 lst-kix_ua6875mw8lz1-0\" start=\"5\"><li class=\"c5 li-bullet-0\"><span class=\"c1\">&ldquo;I don&rsquo;t have time for a man anyway&rdquo;</span></li></ol><ul class=\"c0 lst-kix_ua6875mw8lz1-1 start\"><li class=\"c3 li-bullet-0\"><span class=\"c1\">The best way to move past a one-sided romance is to convince yourself that you don&#39;t even need it in the first place. I&rsquo;m an academic weapon with meaningful friendships and hobbies. What the hell would I even do with a man? (Please HMU I&rsquo;m desperate)</span></li></ul></body></html>",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2F6La5TtaYIt3AJrUBdDG6rA%2FoQ2QdrtMYvjbsisSWbSRAs3JrQmA31piFa51L5AG7QABAZrJExr29d2o93leDMLymTzUauuCA1zgEE5dweOX-824KryUfwP_V0CBrHkRJh7jg-JlTKkhM6JItsvyXhK9tJh6nsaZ4TsB2QijPqPPBQ%2FWs7HlUJLUT9_tVheDMqn7uaAy5AMkkSnZGWoBaZlZpc",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-27T16:42:22.103Z",
      "name": [
        "Aidan Fairchild-Sandoval"
      ],
      "photo": [
        "recfJ29zsXVWwTE02"
      ],
      "name_photo": [
        "Maya Bride"
      ],
      "createdAt": "2025-04-11T01:02:27.342Z"
    },
    {
      "id": "recW5HnXSUGwtT1aP",
      "title": "This Feels Like a Metaphor: Walking Home on Thin Ice Carrying $10 Eggs",
      "description": "Hm… Egg in hand, ice beneath foot, Olga on phone. Something’s wrong. I look around. I look up. I look down. I look at the eggs. ",
      "content": "Hm… Egg in hand, ice beneath foot, Olga on phone. Something’s wrong. I look around. I look up. I look down. I look at the eggs. There’s a receipt hiding in my fingers. I lean down with my mouth to snatch it, and as I do, I slip. Oops… Must be more careful. I carefully take a peek at the receipt. \n\n$10 Eggs?! \n\nIn shock, my foot slides up on the slippery ice, and I begin to fall. As I fall, I pray to the Gxd of Pity to practice their ways and protect me. As I do, the divine intervention does exactly that and protects the most important, valuable, and expensive thing: the eggs. The eggs float in the air as I crash down into the thin ice, breaking it. Shards fly up my spine and snuggle in my asscrack. A stunning moment of divinity. As I lay there staring up at my fortune floating above me, I hear the laughter echoing from my best friend, Olga Syphil, who is still on the phone for some reason. \n\nAs the stars and birds flying around my head dissipate, I manage to sit up, which unfortunately only pushes the shards further up my ass (it’s okay, I don’t mind, I was born for this) despite the fragility of the frozen water.\n\nI look back at the store from which I came. Target. I knew I shouldn’t have bought something from that sellout company. Fuck Target and their weak-ass DEI rollbacks. I should’ve gone to Trader Joe’s. They would never have allowed me to slip on this ice. \n\nBut what’s done is done. I stand up (the shards in my ass now melted, dripping down, as if I was just doing colonoscopy prep and pee shitting from my ass), grab the eggs, and thank the Gxd of Pity. \n\nBut something’s still wrong, I can sense it.\n\nI open the carton of eggs, and to my horror, I realize that the worst thing has come true. They were fertilized. Great. Now I have to not only spend money on expensive ass food for myself, but I also have to spend a fortune to raise a dozen little chicks. Fuck my stupid baka life. \n\nBut then I look around and think (something that they don’t want you to do) and my mind begins to open and awaken.\n\nCould this experience be… a metaphor?",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2FlfhysiEk7bIm35onl6gdKg%2FuUa75ts0IP3Q7gbNc3gt4iat428vgxiVEqd3f-urvST--X2ht9omlzwz0qXb_SVEjMpSDNVnc1u01v-eHsE9EA2_FPztUKWxYhY5svJAj5q26ISg8NhdQu_UFVF2_lpDUTrqGyQpI_App3d4XFPUAQ%2FlDyZLp6MdeySndCczTUHxKVVufBJ8RnbF7Zw52BBwec",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-21T15:09:00.000Z",
      "name": [
        "Doran Steinfeld"
      ],
      "photo": [
        "recNwxpWgzmS6Ts1F"
      ],
      "name_photo": [
        "Elizabeth Morearty"
      ],
      "createdAt": "2025-04-11T01:02:27.342Z"
    },
    {
      "id": "recqkxTgFd50gZVYa",
      "title": "That’s So True, I Know the End: My Application To Be Paul Mescal’s Next Victim",
      "description": "As we are coming off of the St. Patrick’s holiday weekend, I’d like to give an encore to our favorite slutty chain-wearing Irish man Paul Mescal. ",
      "content": "<p>As we are coming off of the St. Patrick’s holiday weekend, I’d like to give an encore to our favorite slutty chain-wearing Irish man Paul Mescal. Growing up, I was a Niall Horan girl, but then I really resonated with the synopsis of <em>Normal People</em>. The iconic scene when Marianne asks if Connell has talked to other girls at uni and he’s like—I'm literally still inside you—I realized that that’s something I would do. I think the perfect way for us to meet would be by both of us getting cast in a Jenny Han production, the author of <em>To All the Boys I’ve Loved Before</em> and <em>The Summer I Turned Pretty</em>, since I can seamlessly play the role of another half-Asian girl getting fucked over by a white man.</p>\n\n<p>The following are some of my qualifications for being Paul Mescal’s next victim:</p>\n\n<ul>\n<li>Brunette</li>\n<li>Ignores red flags</li>\n<li>Will forgive you easily</li>\n<li>We are probably the same pants size</li>\n<li>>10 years of experience with white men letting me down (possibly can try to get a letter of rec from one of them)</li>\n</ul>\n\n<p>Mescal is obviously in love with Daisy Edgar-Jones. That photo of him with Phoebe Bridgers at the Met Gala contributed to my childhood trauma. I didn’t imagine that his cruelty would continue onto Gracie Abrams, but then I realized he is coming for that whole friend group.</p>\n\n<p>Gracie Abrams has been seen with bangs, so the rumors are just getting stronger. I may not have abs like hers, but I am great at falling for men who don’t want me. I can’t rock the fuck-ass bob either, but if he needs me to get bangs, I’ll do what needs to be done. Now that Julien Baker and Lucy Dacus are confirmed to be dating, he can’t conquer the entire friend group. Another reason I am willing to victimize myself for Paul Mescal is because I feel the need to protect Ayo Edebiri at all costs. After I saw that photo of them together on my feed, I worried for her safety and my sanity. If he is going to keep not admitting his feelings for his one true love, I might as well have some fun and let him hurt me for the plot. Whatever happens, we will be getting a Gracie Abrams album out of it. So Paulie baby, come and get it! I’m ready for you to ruin my life.</p>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2F2BfmKrfKN5VKKIdpNom8fw%2FEgW_RIHzQVMRMKn08plM7JXyM4zHZ9Nq94aRtJUMhaVQ9IEXV_wHIv5ya1l-sq0eeSkecDpAr8Ra-6QzrW61t5RngrRoDljge7GeNituTUFt-S1xQuwlqyit7_kdbbIZwQg5br6LExk_QtIw8KGDiw%2FYlu_gho-bMbwLk2kbcWX2NKGe1wM1Mcf0gC3s3eVQIo",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-20T16:43:00.000Z",
      "name": [
        "Elana Felig "
      ],
      "photo": [
        "rec1PJwtCdLh6gGOy"
      ],
      "name_photo": [
        "Katherine (Katie) Reilly"
      ],
      "createdAt": "2025-04-11T01:02:27.343Z"
    },
    {
      "id": "recRBoofsKHcgXYIv",
      "title": "How To Handle Dictatorships And Dick-tatorships ",
      "description": "Surprise! They are the same thing.",
      "content": "<p>Surprise! They are the same thing. As far as ego and unrealistic perceptions of the self go, dick-tators and reigns of terror are caused by the same fundamental “shortcoming.” Those in power lack a certain je ne sais quoi which ultimately causes catastrophic repercussions felt throughout the nation. No matter the country, there will always be a rather unsavory explanation for the gradual demise of democratic systems.</p>\n\n<p>It can be quite discouraging to find yourself as a tiny sheep so carelessly being herded around by the big bad wolf. Here are three expert tested suggestions to get through trying times and ridiculous autocracies:</p>\n\n<p><strong>Cut it off</strong><br>\nMove to another country! People always say they will do it but have you actually tried to? Europe is practically begging people to move back after making all those mistakes for hundreds of years. You can actually be financially compensated for your decision in some countries, including Italy and Switzerland. Pasta and cheese with holes all day? Say no more!</p>\n\n<p><strong>Plead for growth</strong><br>\nWith all the technological patents and companies your dictator owns, surely your dictator will have figured out how to turn this shortcoming into the next Terminator. Once the sad shrimp turns into a techno tank, everyone's problems will be solved and there will be no need to uproot your entire life.</p>\n\n<p><strong>Introduce Organic/Non GMO Options</strong><br>\nIf the suggestion above does not yield favorable results and ChatGPT fails to give the correct instructions to fix the issue, pass on the idea of natural healing. With the proper levels of phosphorus and enough sunlight to induce photosynthesis, perhaps Danny Devito in the seminal role of the Lorax will speak for us after all: “unless someone like you cares an awful lot, nothing is going to get better, it's not.”</p>\n",
      "contentFormat": "html",
      "imageUrl": "/api/images/https%3A%2F%2Fv5.airtableusercontent.com%2Fv3%2Fu%2F40%2F40%2F1744344000000%2Fg2ZV-lFmuk4ODns4_HidSQ%2FuiVrLR8Jhwz8o3KMNGUhVD3lRxHt06C55fCch2_2GzjpU0KU3fNyj0nwMXFpom9-coEZ6Lshz47q9Lzx9lVpL1aSFGWlag4wd-_tHoNuF3pm6H6JCicFm2yDf2C6JMMdTBCrhnmmKlPAQbHRLfzdFg%2FlaNSo98mhaoDc_LMbfUh6Fk0g9pB5guPznxQVN3xu0E",
      "imageType": "url",
      "imagePath": null,
      "featured": false,
      "publishedAt": "2025-03-19T15:17:00.000Z",
      "name": [
        "Willa Norvell"
      ],
      "photo": [
        "recNrwwoaPVdgg85g"
      ],
      "name_photo": [
        "Via Sznewajs"
      ],
      "createdAt": "2025-04-11T01:02:27.344Z"
    }
  ],
  "timestamp": 1744333347345
}